app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."restaurant_id" = '1'
---
  def show
    @restaurant = Restaurant.find(params[:id])
    @reviews = Review.where restaurant_id: params[:id]

INSERT INTO "restaurants" ("created_at", "description", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-12-19 15:00:22.037250"], ["description", "A totally not crappy fastfood place"], ["name", "McDonalds"], ["updated_at", "2014-12-19 15:00:22.037250"], ["user_id", 1]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save