app/controllers/reviews_controller.rb

  def new
    @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @restaurant_id = params[:restaurant_id]
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = Review.new(review_params)
    @review.restaurant_id = @restaurant_id

    if @review.save
---
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("restaurant_id", "review", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["restaurant_id", 1], ["review", "This place was bad.  I got food poisoning."], ["user_id", 2]]